# IsTitleblockRevisionSchedule Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSheetInstance..::..IsTitleblockRevisionSchedule Property
ScheduleSheetInstance Class See Also
---
Identifies if this ScheduleSheetInstance is a revision schedule in a titleblock family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsTitleblockRevisionSchedule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsTitleblockRevisionSchedule As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsTitleblockRevisionSchedule {
	bool get ();
}
```

# Remarks
These schedule instances should not be modified in the project environment. To modify the revision schedule on a titleblock, edit the titleblock family.
# See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace